app/controllers/collections_controller.rb

SELECT "collections".* FROM "collections" WHERE (name LIKE '%test here%')  ORDER BY created_at DESC
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @collections = Collection.all
    @username = User.find(session[:user_id]).name

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @collection = Collection.new
    @userId = User.find(session[:user_id]).id

INSERT INTO "collections" ("album", "artist", "song", "favorite", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["album", "1"], ["artist", "1"], ["song", "3"], ["favorite", "Y"], ["user_id", 1], ["created_at", "2016-07-18 02:39:29.617654"], ["updated_at", "2016-07-18 02:39:29.617654"]]
---
  def create
    @collection = Collection.new(collection_params)
    #@collection = @user.collections.create(collection_params)
    respond_to do |format|
      if @collection.save

UPDATE "collections" SET "user_id" = ?, "updated_at" = ? WHERE "collections"."id" = ?  [["user_id", nil], ["updated_at", "2016-07-18 03:07:54.870142"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @collection.update(collection_params)

SELECT "collections".* FROM "collections" WHERE (collectoins.album LIKE '%test1%' OR collectoins.song LIKE '%test1%')
---
  def result
    if params[:search]
      @results = Collection.search(params[:search])

SELECT  "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_collection
      @collection = Collection.find(params[:id])